/* шаблон вопроса:
    {
                                                                //текст вопроса. каждый абзац писать в новых кавычках, все абзацы через запятую:
        question: [
            "тип 1 - простой, ответ строкой",
            "абзац 2",
            "И так далее_______",
            "сколько угодно"
        ],

                                                               //картинка. если ее нет - ставить "", если есть - писать в кавычках путь до картинки:
        imageSrc: "img/2.png",

                                                               //таблица в вопросе. если есть - ставить true если нет ставить false
        table: true,

                                                               //необязательный. если есть таблица - левая ячейка таблицы. писать текст как в вопросе. если таблицы нет - ни на что не влияет
        tableLeft: [
            "тип 4",
            "абзац 2",
            "И так далее_______",
            "сколько угодно"
        ],

                                                                //необязательный. если есть таблица - правая ячейка таблицы. писать текст как в вопросе. если таблицы нет - ни на что не влияет
        tableRight: [
            "тип 4",
            "абзац 2",
            "И так далее_______",
            "сколько угодно"
        ],

                                                                //тип ответа.
                                                                //text - текстовая строка,
                                                                //table-horizontal - горизонтальная таблица,
                                                                //table-vertical - вертикальная таблица,
                                                                //textarea - текстовая область
                                                                //важная часть. от этого зависит, какие блоки будут показаны и что будет проверяться. писать в кавычках
        typeOfAnswer: "text",

                                                                //ответ. писать в кавычках, даже если предполагается таблица. КРОМЕ текстовой области
        answer: "ответ",

                                                                //ответ к текстовой области. заполнять как текст вопроса
        answerTextarea: [
            "ответ",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
        ],

                                                                //необязательный. если тип ответа - горизонтальная таблица, запрашивает количество столбцов.
        columns: 4,

                                                                //необязательный. если тип ответа - вертикальная таблица, запрашивает количество строк для ответа. названия столбцов не считаются
        rows: 4,

                                                                //необязательный. если тип ответа - вертикальная таблица, название левого столбца
        nameOfLeftColumn: "События",

                                                                //необязательный. если тип ответа - вертикальная таблица, название правого столбца
        nameOfRightColumn: "Факты",

                                                                //количество советников. если их нет - ставить 0
        countHelpers: 1,

                                                                //текст советов. каждый совет в отдельных кавычках через запятую
        helpers: [
            "совет 1",
        ],
    },
*/

//вопросы на первый тест

let questions = [
    {
        question: [
            "тип 1 - простой, ответ строкой",
            "абзац 2",
            "И так далее_______",
            "сколько угодно"
        ],
        imageSrc: "",
        table: false,
        typeOfAnswer: "text",
        answer: "ответ",
        countHelpers: 0,
    },
    {
        question: [
            "тип 2 - горизонтальная таблица",
            "абзац 2",
            "И так далее_______",
            "сколько угодно"
        ],
        imageSrc: "",
        table: false,
        typeOfAnswer: "table-horizontal",
        answer: "1231",
        columns: 4,
        countHelpers: 0,
    },
    {
        question: [
            "тип 3 - как первый",
            "абзац 2",
            "И так далее_______",
            "сколько угодно",
            "только с советником"
        ],
        imageSrc: "",
        table: false,
        typeOfAnswer: "text",
        answer: "ответ",
        countHelpers: 1,
        helpers: [
            "совет 1",
        ],
    },
    {
        question: [
            "тип 4 ",
            "абзац 2",
            "И так далее_______",
            "сколько угодно",
            "два советника",
        ],
        imageSrc: "",
        table: true,
        tableLeft: [
            "тип 4",
            "абзац 2",
            "И так далее_______",
            "сколько угодно"
        ],
        tableRight: [
            "тип 4",
            "абзац 2",
            "И так далее_______",
            "сколько угодно"
        ],
        typeOfAnswer: "table-vertical",
        answer: "1234",
        nameOfLeftColumn: "События",
        nameOfRightColumn: "Факты",
        rows: 4,
        countHelpers: 2,
        helpers: [
            "совет 1",
            "совет 2",
        ],
    },
    {
        question: [
            "тип 5 - как первый только с картинкой",
            "абзац 2",
            "И так далее_______",
            "текст тексттекст текст текст текст текст текст текст тексттекст тексттекст тексттекст текст текст текст текст тексттекст тексттекст тексттекст тексттексттекст тексттекст тексттекст м текст",
            "большой текст был"
        ],
        imageSrc: "img/2.png",
        table: false,
        typeOfAnswer: "text",
        answer: "ответ",
        countHelpers: 0,
    },
    {
        question: [
            "тип 6",
            "абзац 2",
            "И так далее_______",
            "текст тексттекст текст текст текст текст текст текст тексттекст тексттекст тексттекст текст текст текст текст тексттекст тексттекст тексттекст тексттексттекст тексттекст тексттекст м текст",
            "большой текст был"
        ],
        imageSrc: "",
        table: false,
        typeOfAnswer: "textarea",
        answer: "",
        answerTextarea: [
            "ответ",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
            "много строчек",
            "много-много",
        ],
        countHelpers: 0,
    },
];